ConfigFiles/Catalogs/ВидыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыПланов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВидовПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСогласуемогоРесурсаПлановыхРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСогласуемыхРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговоеЗначениеПрочихРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОформленияНезаполненнаяЦель</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОформленияНезаполненоЧтоДостигнуто</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскийПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладельцыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговоеЗначениеЭтапаПопаданиеВПланЗанятости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативПланируемогоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогОтклоненияОтНормативаПланируемогоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодичностьПланов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПериодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВладельцыПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Enums/СтатусыВидовПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыВидовПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеАктуален</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ТипыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занятости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/ВидыПланов/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьОтборыПараметрыДинамическогоСписка();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	ОбщегоНазначенияСППРКлиентСервер.ОтборПоЗначениюСпискаПередЗагрузкойИзНастроек(Список,
	                                                                               "Статус",
	                                                                               Статус,
	                                                                               СтруктураБыстрогоОтбора, 
	                                                                               Настройки);
	
	ОбщегоНазначенияСППРКлиентСервер.ОтборПоЗначениюСпискаПередЗагрузкойИзНастроек(Список,
	                                                                               "ТипПлана",
	                                                                               ТипПлана,
	                                                                               СтруктураБыстрогоОтбора, 
	                                                                               Настройки);
	
	Если СтруктураБыстрогоОтбора <> Неопределено 
		   И ТипЗнч(СтруктураБыстрогоОтбора) = Тип("Структура") Тогда
		
		Настройки.Удалить("ПоказыватьВидыПланов")
		
	Иначе
		
		ПоказыватьВидыПланов = Настройки.Получить(ПоказыватьВидыПланов);
		ОбработатьИзменениеОтбораПоказывать(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВидыПланов" Тогда
		УстановитьПараметрыДинамическихСписков();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
	                                                                        "Статус",
	                                                                        Статус,
	                                                                        ВидСравненияКомпоновкиДанных.Равно,
	                                                                        ,
	                                                                        ЗначениеЗаполнено(Статус));
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВидыПлановПриИзменении(Элемент)
	
	ОбработатьИзменениеОтбораПоказывать(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборыПараметрыДинамическогоСписка()
	
	СтруктураБыстрогоОтбора = Неопределено;
	
	УстановитьПараметрыДинамическихСписков();
	
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	ОбщегоНазначенияСППРКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список,
	                                                                           "Статус",
	                                                                           Статус,
	                                                                           СтруктураБыстрогоОтбора,,
	                                                                           ВидСравненияКомпоновкиДанных.ВСписке); 
	
	ОбщегоНазначенияСППРКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список,
	                                                                           "ТипПлана",
	                                                                           ТипПлана,
	                                                                           СтруктураБыстрогоОтбора,,
	                                                                           ВидСравненияКомпоновкиДанных.Равно);
	
	Если ТипЗнч(СтруктураБыстрогоОтбора) = Тип("Структура")
		И СтруктураБыстрогоОтбора.Свойство("ПоказыватьВидыПланов") Тогда
		ПоказыватьВидыПланов = СтруктураБыстрогоОтбора.ПоказыватьВидыПланов;
	КонецЕсли;
	
	ОбработатьИзменениеОтбораПоказывать(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Условное оформление динамического списка "Список"
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
#Область Статус
	
	// Выделение цветом состояния "Не действует"
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение цветом статус ""Не действует""'");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыВидовПланов.НеАктуален;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	
#КонецОбласти

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()

	МассивВидовПлановЯВладелец = Новый Массив;
	МассивВидовПлановЯУчастник = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	ВидыПлановВладельцы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыПланов.ВладельцыПлана КАК ВидыПлановВладельцы 
	|ГДЕ
	|	ВидыПлановВладельцы.Владелец = &ТекущийПользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыПлановУчастникиПланирования.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыПланов.УчастникиПланирования КАК ВидыПлановУчастникиПланирования
	|ГДЕ
	|	ВидыПлановУчастникиПланирования.Участник = &ТекущийПользователь";
	
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаВидыПлановЯВладелец = Результат[0].Выбрать();
	ВыборкаВидыПлановЯУчастник = Результат[1].Выбрать();
	
	Пока ВыборкаВидыПлановЯВладелец.Следующий() Цикл
	
		МассивВидовПлановЯВладелец.Добавить(ВыборкаВидыПлановЯВладелец.Ссылка);
	
	КонецЦикла;
	
	Пока ВыборкаВидыПлановЯУчастник.Следующий() Цикл
	
		МассивВидовПлановЯУчастник.Добавить(ВыборкаВидыПлановЯУчастник.Ссылка);
	
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидыПланаЯУчастник", МассивВидовПлановЯУчастник);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидыПланаЯВладелец", МассивВидовПлановЯВладелец);
	
	ОбработатьИзменениеОтбораПоказывать(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеОтбораПоказывать(Форма)
	
	ПоказыватьВидыПлановЯУчастник          = Ложь;
	ПоказыватьВидыПлановЯВладелец          = Ложь;
	ПоказыватьВидыПлановЯВладелецЯУчастник = Ложь;
	
	Если Форма.ПоказыватьВидыПланов = "УчастникИлиВладелец" Тогда
		ПоказыватьВидыПлановЯВладелецЯУчастник = Истина;
	ИначеЕсли Форма.ПоказыватьВидыПланов = "ВидыПлановЯУчастник" Тогда
		ПоказыватьВидыПлановЯУчастник = Истина;
	ИначеЕсли Форма.ПоказыватьВидыПланов = "ВидыПлановЯВладелец" Тогда
		ПоказыватьВидыПлановЯВладелец = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список,"ПоказыватьВидыПлановЯВладелецЯУчастник", ПоказыватьВидыПлановЯВладелецЯУчастник);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список,"ПоказыватьВидыПлановЯУчастник",          ПоказыватьВидыПлановЯУчастник);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список,"ПоказыватьВидыПлановЯВладелец",          ПоказыватьВидыПлановЯВладелец);
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	Если Форма.ТипПлана = ПредопределенноеЗначение("Перечисление.ТипыПланов.Занятости") Тогда
		
		Форма.Заголовок = НСтр("ru = 'Виды планов занятости'");
		Форма.Элементы.РодительскийПлан.Видимость = Ложь;
		
	ИначеЕсли Форма.ТипПлана = ПредопределенноеЗначение("Перечисление.ТипыПланов.Рабочий") Тогда
		
		Форма.Заголовок = НСтр("ru = 'Виды рабочих планов'");
		
	Иначе
		
		Форма.Заголовок = НСтр("ru = 'Виды планов'");
		
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти
